{
  "paths": [
    {
      "type": "dir",
      "name": "v0",
      "children": [
        {
          "type": "dir",
          "name": "1d",
          "children": [
            {
              "type": "dir",
              "name": "general",
              "children": [
                {
                  "type": "file",
                  "value": "v0/1d/general/fullScreen.md"
                }
              ]
            },
            {
              "type": "dir",
              "name": "integral",
              "children": [
                {
                  "type": "file",
                  "value": "v0/1d/integral/integration.md"
                }
              ]
            },
            {
              "type": "dir",
              "name": "load",
              "children": [
                {
                  "type": "file",
                  "value": "v0/1d/load/loadSpectrum.md"
                }
              ]
            },
            {
              "type": "dir",
              "name": "peak",
              "children": [
                {
                  "type": "file",
                  "value": "v0/1d/peak/peakPicking.md"
                }
              ]
            },
            {
              "type": "dir",
              "name": "zoom",
              "children": [
                {
                  "type": "file",
                  "value": "v0/1d/zoom/zoomIn.md"
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "contents": [
    {
      "path": "v0/1d/general/fullScreen.md",
      "url": "v0/1d/general/fullScreen.html",
      "content": "#### Full screen mode\r\n\r\nClick the \"full Screen button\" to open the full screen mode.\r\n\r\n![image](images/fullscreen.gif)\r\n\r\n#### Exit full screen mode\r\n\r\nTo exit the full screen mode,  press ESC on the keyboard. Another possibility to exit the full screen mode is to press the right mouse button. A new, small window appears in which \"Exit full screen\" must be clicked with the left mouse button.",
      "html": "<h4 id=\"full-screen-mode\">Full screen mode <a class=\"heading-anchor-permalink\" href=\"#full-screen-mode\">#</a></h4>\n<p>Click the “full Screen button” to open the full screen mode.</p>\n<p><img src=\"images/fullscreen.gif\" alt=\"image\"></p>\n<h4 id=\"exit-full-screen-mode\">Exit full screen mode <a class=\"heading-anchor-permalink\" href=\"#exit-full-screen-mode\">#</a></h4>\n<p>To exit the full screen mode,  press ESC on the keyboard. Another possibility to exit the full screen mode is to press the right mouse button. A new, small window appears in which “Exit full screen” must be clicked with the left mouse button.</p>\n",
      "id": 0
    },
    {
      "path": "v0/1d/integral/integration.md",
      "url": "v0/1d/integral/integration.html",
      "content": "#### Automatic integration\r\n\r\nYou mark a signal by simultaneously holding down the shift key and the left mouse button and moving the mouse over the range of the signal. After releasing both keys, the integral of the signal appears. On the right side of the screen, under the \"Integrals\" tab, a list of all integrals is listed. If you move the mouse over the shift of the integral in the spectrum, the corresponding entry is displayed in the list. If you move the mouse over a certain line in the list, the corresponding integral in the spectrum is marked.\r\n\r\n![image](images/integral-picking.gif)\r\n\r\n#### Delete all integrals\r\n\r\nTo delete all integrals move the mouse to the list \"Integrals\" and press the trash button on the left side above the list. A red box apears. Click \"yes\". All integrals are deleted.\r\n\r\n![image](images/delete-all-integrals.gif)\r\n\r\n#### Delete a single integral\r\n\r\nTo delete one integral move the mouse to the list and select a integral. Press the trash button on the rigth side of the line of the signal. The integral is deleted.\r\n\r\nAn alternativ way to delete a single integral is to move the mouse over a integral in the spectrum. A red ring appears. Click this red ring, the integral is deleted.\r\n\r\n![image](images/delete-single-integral.gif)\r\n\r\n\r\n#### Change integral sum\r\n\r\nThe default sum of all integrated protons is 100. To change this sum, click on the sum symbol. A grey box appears. Enter the total number of integrated protons and click \"Set\".  In the list on the right side, the relative number of protons for the respective integral is indicated.\r\n\r\n![image](images/change-integral-sum.gif)\r\n\r\n",
      "html": "<h4 id=\"automatic-integration\">Automatic integration <a class=\"heading-anchor-permalink\" href=\"#automatic-integration\">#</a></h4>\n<p>You mark a signal by simultaneously holding down the shift key and the left mouse button and moving the mouse over the range of the signal. After releasing both keys, the integral of the signal appears. On the right side of the screen, under the “Integrals” tab, a list of all integrals is listed. If you move the mouse over the shift of the integral in the spectrum, the corresponding entry is displayed in the list. If you move the mouse over a certain line in the list, the corresponding integral in the spectrum is marked.</p>\n<p><img src=\"images/integral-picking.gif\" alt=\"image\"></p>\n<h4 id=\"delete-all-integrals\">Delete all integrals <a class=\"heading-anchor-permalink\" href=\"#delete-all-integrals\">#</a></h4>\n<p>To delete all integrals move the mouse to the list “Integrals” and press the trash button on the left side above the list. A red box apears. Click “yes”. All integrals are deleted.</p>\n<p><img src=\"images/delete-all-integrals.gif\" alt=\"image\"></p>\n<h4 id=\"delete-a-single-integral\">Delete a single integral <a class=\"heading-anchor-permalink\" href=\"#delete-a-single-integral\">#</a></h4>\n<p>To delete one integral move the mouse to the list and select a integral. Press the trash button on the rigth side of the line of the signal. The integral is deleted.</p>\n<p>An alternativ way to delete a single integral is to move the mouse over a integral in the spectrum. A red ring appears. Click this red ring, the integral is deleted.</p>\n<p><img src=\"images/delete-single-integral.gif\" alt=\"image\"></p>\n<h4 id=\"change-integral-sum\">Change integral sum <a class=\"heading-anchor-permalink\" href=\"#change-integral-sum\">#</a></h4>\n<p>The default sum of all integrated protons is 100. To change this sum, click on the sum symbol. A grey box appears. Enter the total number of integrated protons and click “Set”.  In the list on the right side, the relative number of protons for the respective integral is indicated.</p>\n<p><img src=\"images/change-integral-sum.gif\" alt=\"image\"></p>\n",
      "id": 1
    },
    {
      "path": "v0/1d/load/loadSpectrum.md",
      "url": "v0/1d/load/loadSpectrum.html",
      "content": "#### Open a spectrum\r\n\r\nTo open a spectrum, the Jcamp or NMRium file with the raw data must be dragged or copied and pasted from the computer into the workspace. To do this, the corresponding jcamp files are selected in the Explorer and dragged into the workspace with the left mouse button held down.\r\n\r\n![image](images/import-spectrum.gif)\r\n\r\nAlternatively the link to a jcamp file can be opened. On the left side of the workspace there is a bar with buttons. By clicking the third button from above and then clicking the text \"Add jcamp from URL\" a small window opens. In this window you can either insert the link to the corresponding file or enter it using the keyboard. Clicking the \"Load\" button in the small window opens the spectrum\r\n\r\n\r\n#### switch between spectra \r\n\r\nYou can switch between 1H and 13C spectra by clicking the corresponding icon. The Dept spectrum is located under the 13C button.\r\n\r\n\r\n![image](images/switch-between-spectra.gif)\r\n",
      "html": "<h4 id=\"open-a-spectrum\">Open a spectrum <a class=\"heading-anchor-permalink\" href=\"#open-a-spectrum\">#</a></h4>\n<p>To open a spectrum, the Jcamp or NMRium file with the raw data must be dragged or copied and pasted from the computer into the workspace. To do this, the corresponding jcamp files are selected in the Explorer and dragged into the workspace with the left mouse button held down.</p>\n<p><img src=\"images/import-spectrum.gif\" alt=\"image\"></p>\n<p>Alternatively the link to a jcamp file can be opened. On the left side of the workspace there is a bar with buttons. By clicking the third button from above and then clicking the text “Add jcamp from URL” a small window opens. In this window you can either insert the link to the corresponding file or enter it using the keyboard. Clicking the “Load” button in the small window opens the spectrum</p>\n<h4 id=\"switch-between-spectra\">switch between spectra <a class=\"heading-anchor-permalink\" href=\"#switch-between-spectra\">#</a></h4>\n<p>You can switch between 1H and 13C spectra by clicking the corresponding icon. The Dept spectrum is located under the 13C button.</p>\n<p><img src=\"images/switch-between-spectra.gif\" alt=\"image\"></p>\n",
      "id": 2
    },
    {
      "path": "v0/1d/peak/peakPicking.md",
      "url": "v0/1d/peak/peakPicking.html",
      "content": "#### Select a single signal\r\n\r\nTo select a single signal, click the \"peaks picking\" button. Move the mouse to the selected signal and click on it with the left mouse button. The peak shift appears over the signal. The exact value of the signal can be found in a table on the right side of the interface under the \"peaks\" tab.\r\n\r\n![image](images/single-peak-picking.gif)\r\n\r\n#### Automatic single peak picking\r\n\r\nYou mark a signal by simultaneously holding down the shift key and the left mouse button and moving the mouse over the range of the signal. After releasing both keys, the shift of the signal appears. On the right side of the screen, under the \"Peaks\" tab, a list of all selected signals is listed. If you move the mouse over the shift of the signal in the spectrum, the corresponding entry is displayed in the list. A signal is listed for the range that has been marked with the mouse: The range is stored as a multiplet, which has to be analyzed more precisely with \"range peaking\". If you move the mouse over a certain line in the list, the corresponding shift in the spectrum is marked.\r\n\r\n![image](images/automatic-single-peak-picking.gif)\r\n\r\n\r\n#### Delete all peaks\r\n\r\nTo delete all signals move the mouse to the list \"Peaks\" and press the trash button on the left side above the list. A red box apears. Click \"yes\". All signals are deleted.\r\n\r\n\r\n![image](images/delete-all-peaks.gif)\r\n\r\n#### Delete a single peak\r\n\r\nTo delete one signal move the mouse to the list and select a signal. Press the trash button on the rigth side of the line of the signal. The peak is deleted.\r\n\r\nAn alternativ way is to move the mouse over a signal in the spectrum. A red ring appears. Click this red ring, the peak is deleted.\r\n\r\n![image](images/delete-single-peak.gif)\r\n\r\n",
      "html": "<h4 id=\"select-a-single-signal\">Select a single signal <a class=\"heading-anchor-permalink\" href=\"#select-a-single-signal\">#</a></h4>\n<p>To select a single signal, click the “peaks picking” button. Move the mouse to the selected signal and click on it with the left mouse button. The peak shift appears over the signal. The exact value of the signal can be found in a table on the right side of the interface under the “peaks” tab.</p>\n<p><img src=\"images/single-peak-picking.gif\" alt=\"image\"></p>\n<h4 id=\"automatic-single-peak-picking\">Automatic single peak picking <a class=\"heading-anchor-permalink\" href=\"#automatic-single-peak-picking\">#</a></h4>\n<p>You mark a signal by simultaneously holding down the shift key and the left mouse button and moving the mouse over the range of the signal. After releasing both keys, the shift of the signal appears. On the right side of the screen, under the “Peaks” tab, a list of all selected signals is listed. If you move the mouse over the shift of the signal in the spectrum, the corresponding entry is displayed in the list. A signal is listed for the range that has been marked with the mouse: The range is stored as a multiplet, which has to be analyzed more precisely with “range peaking”. If you move the mouse over a certain line in the list, the corresponding shift in the spectrum is marked.</p>\n<p><img src=\"images/automatic-single-peak-picking.gif\" alt=\"image\"></p>\n<h4 id=\"delete-all-peaks\">Delete all peaks <a class=\"heading-anchor-permalink\" href=\"#delete-all-peaks\">#</a></h4>\n<p>To delete all signals move the mouse to the list “Peaks” and press the trash button on the left side above the list. A red box apears. Click “yes”. All signals are deleted.</p>\n<p><img src=\"images/delete-all-peaks.gif\" alt=\"image\"></p>\n<h4 id=\"delete-a-single-peak\">Delete a single peak <a class=\"heading-anchor-permalink\" href=\"#delete-a-single-peak\">#</a></h4>\n<p>To delete one signal move the mouse to the list and select a signal. Press the trash button on the rigth side of the line of the signal. The peak is deleted.</p>\n<p>An alternativ way is to move the mouse over a signal in the spectrum. A red ring appears. Click this red ring, the peak is deleted.</p>\n<p><img src=\"images/delete-single-peak.gif\" alt=\"image\"></p>\n",
      "id": 3
    },
    {
      "path": "v0/1d/zoom/zoomIn.md",
      "url": "v0/1d/zoom/zoomIn.html",
      "content": "#### Zoom In\r\n\r\nTo activate the zoom function press the button or press key \"z\". Than you can mark the interested area of the spectra with the left mouse button. This area is scaled up.\r\n\r\n![image](images/zoom-in.gif)\r\n\r\n",
      "html": "<h4 id=\"zoom-in\">Zoom In <a class=\"heading-anchor-permalink\" href=\"#zoom-in\">#</a></h4>\n<p>To activate the zoom function press the button or press key “z”. Than you can mark the interested area of the spectra with the left mouse button. This area is scaled up.</p>\n<p><img src=\"images/zoom-in.gif\" alt=\"image\"></p>\n",
      "id": 4
    }
  ]
}